app/Controllers/Admin.php

SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `actif` = 1
SELECT COUNT(*) AS `numrows` FROM `employes`
SELECT COUNT(*) AS `numrows` FROM `departements`
SELECT COUNT(*) AS `numrows` FROM `types_conge`
---
    public function index()
    {
        $data = [
            'title' => 'Tableau de bord Admin',
            'totalEmployes' => $this->employeModel->countAll(),
            'totalDepartements' => $this->departementModel->countAll(),
            'employesActifs' => $this->employeModel->where('actif', 1)->countAllResults(),
            'totalTypesConge' => $this->typeCongeModel->countAll(),
        ];

SELECT *
FROM `employes`
SELECT *
FROM `departements`
---
    public function employes()
    {
        $employes = $this->employeModel->findAll();
        $departements = $this->departementModel->findAll();

SELECT *
FROM `departements`
---
    public function createEmploye()
    {
        $departements = $this->departementModel->findAll();

INSERT INTO `employes` (`prenom`, `nom`, `email`, `password`, `departement_id`, `role`, `date_embauche`, `actif`) VALUES ('aina', 'abcd', 'a@gmail.com', '$2y$10$KS4vj1sV7Dvwuogn81gytef91o0BsPpMfpAfvjEHPhNqtYGD4/Rgi', '1', 'employe', '2026-05-01', '1')
---
    public function storeEmploye()
    {
        $input = $this->request->getPost();

        // Hash le mot de passe
        if (!empty($input['password'])) {
            $input['password'] = password_hash($input['password'], PASSWORD_DEFAULT);
        }

        if (!$this->employeModel->save($input)) {

SELECT *
FROM `employes`
WHERE `employes`.`id` = '1'
SELECT *
FROM `departements`
---
    public function editEmploye($id)
    {
        $employe = $this->employeModel->find($id);

        if (!$employe) {
            return redirect()->to('/admin/employes')->with('error', 'Employé non trouvé.');
        }

        $departements = $this->departementModel->findAll();

SELECT *
FROM `departements`
---
    public function departements()
    {
        $departements = $this->departementModel->findAll();

INSERT INTO `departements` (`nom`, `description`) VALUES ('Antananarivo', 'La ville du bakart')
---
    public function storeDepartement()
    {
        $input = $this->request->getPost();

        if (!$this->departementModel->save($input)) {