app/Controllers/Auth.php

    public function login()
    {
        if ($this->request->getMethod() === 'POST' || $this->request->getMethod() === 'post') {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $employeModel = new Employe();
            $user = $employeModel->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'a@gmail.com'
 LIMIT 1