app/Controllers/ProduitController.php

    public function index(){
    $model = new ProduitModel();
    $data['produits'] = $model->findAll();
---
SELECT *
FROM `produits`