app/Controllers/Rh.php

SELECT `conges`.*, `employes`.`nom`, `employes`.`prenom`, `types_conge`.`libelle` as `type_conge`
FROM `conges`
JOIN `employes` ON `employes`.`id` = `conges`.`employe_id`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`statut` = 'en_attente'
SELECT *
FROM `conges`
WHERE `conges`.`id` = '2'
---
    public function index()
    {
        if (session()->get('role') !== 'rh' && session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $db = \Config\Database::connect();
        $builder = $db->table('conges');
        $builder->select('conges.*, employes.nom, employes.prenom, types_conge.libelle as type_conge');
        $builder->join('employes', 'employes.id = conges.employe_id');
        $builder->join('types_conge', 'types_conge.id = conges.type_conge_id');
        $builder->where('conges.statut', 'en_attente');
        $demandes = $builder->get()->getResultArray();


        // Fetch soldes for all employees except admin and current RH
        $builderSoldes = $db->table('soldes');
        $builderSoldes->select('soldes.*, employes.nom, employes.prenom, types_conge.libelle as type_conge');
        $builderSoldes->join('employes', 'employes.id = soldes.employe_id');
        $builderSoldes->join('types_conge', 'types_conge.id = soldes.type_conge_id');
        $builderSoldes->where('employes.role !=', 'admin');
        $builderSoldes->where('employes.id !=', session()->get('user_id'));
        $soldes_employes = $builderSoldes->get()->getResultArray();

UPDATE `conges` SET `statut` = 'approuvee', `traite_par` = 3
WHERE `conges`.`id` IN ('2')
SELECT *
FROM `soldes`
WHERE `employe_id` = 4
AND `type_conge_id` = 2
AND `annee` = '2026'
 LIMIT 1
---
    public function traiter($id)
    {
        if (session()->get('role') !== 'rh' && session()->get('role') !== 'admin') {
            return redirect()->to('/login');
        }

        $action = $this->request->getPost('action'); // 'approuver' ou 'refuser'
        $conge = $this->congeModel->find($id);

        if (!$conge || $conge['statut'] !== 'en_attente') {
            return redirect()->to('/rh')->with('error', 'Demande invalide ou déjà traitée.');
        }

        if ($action === 'approuver') {
            $this->congeModel->update($id, [
                'statut' => 'approuvee',
                'traite_par' => session()->get('user_id')
            ]);

            // Deduction logique des soldes
            $solde = $this->soldeModel->where('employe_id', $conge['employe_id'])
                                      ->where('type_conge_id', $conge['type_conge_id'])
                                      ->where('annee', date('Y'))
                                      ->first();

INSERT INTO `soldes` (`employe_id`, `type_conge_id`, `annee`, `jours_attribues`, `jours_pris`) VALUES (4, 2, '2026', 5, 5)
---
            } else {
                // If it doesn't exist, create it with default values from type
                $type = $this->typeCongeModel->find($conge['type_conge_id']);
                $this->soldeModel->insert([
                    'employe_id' => $conge['employe_id'],
                    'type_conge_id' => $conge['type_conge_id'],
                    'annee' => date('Y'),
                    'jours_attribues' => ($type ? $type['jours_annuels'] : 0) - $conge['nb_jours'],
                    'jours_pris' => $conge['nb_jours']
                ]);