app/Controllers/User.php

SELECT *
FROM `soldes`
WHERE `employe_id` = 4
AND `annee` = '2026'
SELECT `conges`.*, `types_conge`.`libelle` as `type_conge`
FROM `conges`
JOIN `types_conge` ON `types_conge`.`id` = `conges`.`type_conge_id`
WHERE `conges`.`employe_id` = 4
ORDER BY `conges`.`created_at` DESC
SELECT *
FROM `types_conge`
---
    public function index()
    {
        $userId = session()->get('user_id');
        if (!$userId) return redirect()->to('/login');

        // Récupérer les soldes de l'employé
        $soldes = $this->soldeModel->where('employe_id', $userId)
                                   ->where('annee', date('Y'))
                                   ->findAll();

        // Récupérer l'historique des demandes
        $db = \Config\Database::connect();
        $builder = $db->table('conges');
        $builder->select('conges.*, types_conge.libelle as type_conge');
        $builder->join('types_conge', 'types_conge.id = conges.type_conge_id');
        $builder->where('conges.employe_id', $userId);
        $builder->orderBy('conges.created_at', 'DESC');
        $historique = $builder->get()->getResultArray();

        $data = [
            'title' => 'Mon Espace',
            'soldes' => $soldes,
            'historique' => $historique,
            'typesConge' => $this->typeCongeModel->findAll() // Pour associer le libellé aux soldes plus facilement

SELECT *
FROM `types_conge`
---
    public function demander()
    {
        $userId = session()->get('user_id');
        if (!$userId) return redirect()->to('/login');

        $data = [
            'title' => 'Demander un congé',
            'typesConge' => $this->typeCongeModel->findAll()

INSERT INTO `conges` (`employe_id`, `type_conge_id`, `date_debut`, `date_fin`, `nb_jours`, `motif`, `statut`, `created_at`) VALUES (4, '2', '2026-05-01', '2026-05-05', 5, 'tsy aiko', 'en_attente', '2026-05-13 10:06:34')
---
    public function store()
    {
        $userId = session()->get('user_id');
        if (!$userId) return redirect()->to('/login');

        $typeId = $this->request->getPost('type_conge_id');
        $dateDebut = $this->request->getPost('date_debut');
        $dateFin = $this->request->getPost('date_fin');
        $motif = $this->request->getPost('motif');

        // Calculer nb jours (basique)
        $d1 = new \DateTime($dateDebut);
        $d2 = new \DateTime($dateFin);
        $nbJours = $d1->diff($d2)->days + 1; // +1 pour inclure le premier et dernier jour

        if ($nbJours <= 0) {
            return redirect()->back()->withInput()->with('error', 'Dates invalides.');
        }

        $this->congeModel->insert([
            'employe_id' => $userId,
            'type_conge_id' => $typeId,
            'date_debut' => $dateDebut,
            'date_fin' => $dateFin,
            'nb_jours' => $nbJours,
            'motif' => $motif,
            'statut' => 'en_attente'
        ]);